swagger/src/Catalogs/Ответы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Ответы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>_description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>content</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>key</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>mediaType</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МедиаТипы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>headers</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>key</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>header</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Заголовки</v8:Type>
								<v8:Type>cfg:CatalogRef.СправочныеОбъекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>links</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>key</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>link</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СправочныеОбъекты</v8:Type>
								<v8:Type>cfg:CatalogRef.Линки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

swagger/src/Catalogs/Ответы/Ext/ObjectModule.bsl
Функция СформироватьJsonSwagger() Экспорт 
	Описание = Новый Соответствие;
	Описание.Вставить("description", ЭтотОбъект._description);
	
	Если ЭтотОбъект.content.Количество() > 0 Тогда
		Описание.Вставить("content", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "content", "key", "mediaType"));
	КонецЕсли;
	Если ЭтотОбъект.headers.Количество() > 0 Тогда
		Описание.Вставить("headers", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "headers", "key", "header"));
	КонецЕсли;
	Если ЭтотОбъект.links.Количество() > 0 Тогда
		Описание.Вставить("links", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "links", "key", "link"));
	КонецЕсли;
	
	Возврат КоннекторHTTP.ОбъектВJson(Описание);
КонецФункции
